[
  {
    "year": "Jun 2025 - Aug 2025",
    "role": "Cloud Identity Engineering Intern",
    "company": "Bose Corporation",
    "description": "",
    "achievements": [
      "Developed a security automation solution through cross-functional collaboration with key stakeholders to analyze existing workflows and writing a custom Python script to query Kubernetes namespaces, interface with the Harbor API, and execute vulnerability scans with Trivy.",
      "Automated builds for 90+ Dockerized microservices by orchestrating a Jenkins CI/CD pipeline that executes the security script weekly, publishing comprehensive buildability and vulnerability reports directly to team Slack channels.",
      "Reduced critical production vulnerabilities by 25%, eliminated 100% of stale images, and cut developer monitoring time by 5 hours/week, establishing the pipeline as the new SDLC management standard."
    ],
    "technologies": [
      "Go",
      "Docker",
      "Kubernetes",
      "Jenkins",
      "CICD",
      "Devops",
      "Prometheus",
      "Grafana"
    ],
    "location": "Framingham, MA, US"
  },
  {
    "year": "Jul 2022 - Jul 2024",
    "role": "Senior Technology Analyst",
    "company": "Deutsche Bank Group",
    "description": "Played a pivotal role in the development of a greenfield application for the bank’s Reconciliations Department, targeting projected savings of €45M over 5 years while streamlining 14 legacy applications for more intuitive workflows.",
    "achievements": [
      "Modernized fintech reconciliation infrastructure by building full stack solutions in a fast-paced Agile environment, consolidating 14 legacy systems into a microservice platform using Spring Boot, React.js microfrontends, and Oracle SQL.",
      "Led a time-critical project from concept to delivery, architecting a full-stack configuration management system with an intuitive UI for business analysts and a Git-based pipeline that cut manual deployment efforts by 40%.",
      "Streamlined data reconciliation workflows by building the frontend dashboards in React.js and the supporting backend REST APIs in Spring Boot, saving 15+ business analysts over 10 hours per week.",
      "Accelerated a high-volume Apache Spark matching engine by 40% by implementing a core Java algorithm using test-driven development that translated abstract JSON business rules into optimized, machine-executable code.",
      "Achieved industry compliance by overhauling the platform’s security and entitlement model, redesigning the JWT authentication flow and implementing a segmented Oracle DB architecture that minimized cross-service data exposure by 95%.",
      "Elevated team proficiency by leading hands-on workshops, interactive pair-programming, and collaborative working sessions in React.js and Database Management, fostering advanced full-stack capabilities in junior developers."
    ],
    "technologies": [
      "Java",
      "Spring Boot",
      "React.js",
      "Oracle Database",
      "UI Design",
      "System Design",
      "Javascript",
      "Neo4j",
      "Git",
      "Bitbucket"
    ],
    "location": "Pune, India"
  },
  {
    "year": "2021",
    "role": "Software Developer Intern",
    "company": "Altruist Technologies Private Limited",
    "description": "During my internship at Altruist Technologies, I independently developed a secure virtual hospital web application as a separate project. This experience allowed me to grasp the end-to-end development of a web application.",
    "achievements": [
      "Architected & developed a secure Virtual Hospital § web application using SpringBoot and native HTML/CSS with key functionalities like appointment booking, prescription generation, notification workflows & a document repository.",
      "Engineered a robust WebRTC framework using WebSocket for real-time collaboration capabilities."
    ],
    "technologies": ["Java", "Spring Boot", "HTML", "CSS", "WebSocket"],
    "location": "Remote"
  },
  {
    "year": "2019",
    "role": "Intern",
    "company": "Aloha Technology",
    "description": "",
    "technologies": ["PHP", "HTML5", "CSS3", "Web Development"],
    "location": "Pune, India"
  }
]
