[
    {
      "year": "2022 - 2024",
      "role": "Senior Technology Analyst",
      "company": "Deutsche Bank Group",
      "description": "Played a pivotal role in the development of a greenfield application for the bank’s Reconciliations Department, targeting projected savings of €45M over 5 years while streamlining 14 legacy applications for more intuitive workflows.",
      "achievements": [
        "Crafted a suite of user-centric utilities and UI screens using React.js, adopted by over 15 Business Analysts, enhancing daily reconciliation processes, driving team collaboration, and improving workflow management.",
"Optimized the core matching platform using Apache Spark, resulting in a 40% improvement in processing speed for high-volume reconciliations and enabling real-time data analysis for stakeholders.",
"Embedded JWT tokens in all APIs for access control, with generic user permissions managed via SQL in Oracle, ensuring secure access for 450+ users and achieving 100% privacy compliance and improved audit scores.",
"Standardized React.js coding standards for OSS compliance and testing, reducing production bugs, while mentoring junior developers on best practices in React.js and database management.",
"Designed a tailored Oracle Database solution that segmented user access for 6 service groups; achieved a 95% reduction in cross-service data access and enhanced compliance with data protection regulations in a microservices architecture.",
"Spearheaded the development of a centralized configuration management system using SpringBoot, Git & Encryption protocols, resulting in a 40% reduction in manual deployment efforts and streamlined version control across 5 teams."
      ],
      "technologies": ["Java", "Spring Boot", "React.js", "Oracle Database", "UI Design", "System Design", "Javascript", "Neo4j", "Git", "Bitbucket"]
    },
    {
      "year": "2021",
      "role": "Software Developer Intern",
      "company": "Altruist Technologies Private Limited",
      "description": "During my internship at Altruist Technologies, I independently developed a secure virtual hospital web application as a separate project. This experience allowed me to grasp the end-to-end development of a web application.",
      "achievements": [
        "Architected & developed a secure Virtual Hospital § web application using SpringBoot and native HTML/CSS with key functionalities like appointment booking, prescription generation, notification workflows & a document repository.",
        "Engineered a robust WebRTC framework using WebSocket for real-time collaboration capabilities."      
      ],
      "technologies": ["Java", "Spring Boot", "HTML", "CSS", "WebSocket"]
    },
    {
      "year": "2019",
      "role": "Intern",
      "company": "Aloha Technology",
      "description": "",
      "technologies": ["PHP", "HTML5", "CSS3", "Web Development"]
    }
  ]